# IFCHybrid Import Update Elements(Document, String) Method

Source: https://www.revitapidocs.com/2026/c92a4f1c-c644-bcd3-97fc-338fac6a2464.htm

---

| IFCHybrid Import Update Elements(Document, String) Method |
| --- |

**Note: This API is now obsolete.**

Updates IFC Elements using AnyCAD.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This is deprecated in Revit 2026.  Please use the updateElements function with the IFCHybridImportOptions.")]
public IList<ElementId> UpdateElements(
	Document doc,
	string file
)
```

```
<ObsoleteAttribute("This is deprecated in Revit 2026.  Please use the updateElements function with the IFCHybridImportOptions.")>
Public Function UpdateElements (
	doc As Document,
	file As String
) As IList(Of ElementId)
```

```
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2026.  Please use the updateElements function with the IFCHybridImportOptions.")]
IList<ElementId^>^ UpdateElements(
	Document^ doc,
	String^ file
)
```

```
[<ObsoleteAttribute("This is deprecated in Revit 2026.  Please use the updateElements function with the IFCHybridImportOptions.")>]
member UpdateElements :
        doc : Document *
        file : string -> IList<ElementId>
```

#### Parameters

doc Document
:   Document to receive elements from the IFC file update.

file String
:   Full path of the file to import.

#### Return Value

IList ElementId
Returns an array of ElementIds representing created or updated elements. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCHybridImport Class UpdateElements Overload Autodesk.Revit.DB.IFC Namespace